Documents/ПоказанияСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПоказанияСчетчиков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ТекущиеПоказания</xr:Item>
				<xr:Item>AccumulationRegister.ПотреблениеЭлектроэнергии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Показания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счетчик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущееПоказание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показание</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПотреблениеКвт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПотреблениеЭлектроэнергии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ПотреблениеЭлектроэнергии</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КвтЧ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бокс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГаражныеБоксы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ввод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВводыЭлектроснабжения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСчетчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСчетчиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеПоказания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеПоказания</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Показание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счетчики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыСчетчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыСчетчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбщийПриборУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПриборУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоказанияСчетчиков/Ext/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	  СчетчикиВДокументе = Новый Массив;
	  Для каждого Стр Из Показания Цикл
		  Если Стр.Счетчик.Пустая() Тогда
			  Продолжить;		
		  КонецЕсли;
		  Если СчетчикиВДокументе.Найти(Стр.Счетчик) <> Неопределено Тогда
			  Сообщить("Счётчик " + Строка(Стр.Счетчик) + " встречается в таблице дважды.");
			  Отказ = Истина;
		  Иначе
			  СчетчикиВДокументе.Добавить(Стр.Счетчик);
		  КонецЕсли;
		  Если Стр.Показание < 0 Тогда
			  Сообщить("Строка " + Стр.НомерСтроки + ": показание не может быть отрицательным.");
			  Отказ = Истина;
		  КонецЕсли;
	  КонецЦикла;
  КонецПроцедуры
  
  Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	  Движения.ПотреблениеЭлектроэнергии.Записывать = Истина;
	  Движения.ТекущиеПоказания.Записывать = Истина;
	  МоментДо = Дата - 1;
	  
	  СписокСчетчиков = Новый Массив;
	  Для каждого Стр Из Показания Цикл
		  Если Не Стр.Счетчик.Пустая() И СписокСчетчиков.Найти(Стр.Счетчик) = Неопределено Тогда
			  СписокСчетчиков.Добавить(Стр.Счетчик);	  
		  КонецЕсли;
	  КонецЦикла;
	  Состояния = ЭлектроУчет.СостоянияСчетчиков(СписокСчетчиков, МоментДо);
	  Для Каждого Стр Из Показания Цикл
		  Если Стр.Счетчик.Пустая() Тогда 
			  Продолжить;
		  КонецЕсли;
		  Состояние = Состояния.Получить(Стр.Счетчик);
		  Если Состояние = Неопределено Тогда
			  Продолжить; 
		  КонецЕсли;
		  
		  ЭтоОбщий = Стр.Счетчик.ТипСчетчика = Перечисления.ТипыСчетчиков.ОбщийПриборУчета;
		  // --- где стоит счётчик ---
		  Если ЭтоОбщий Тогда
			  Если Состояние.ВводУстановки.Пустая() Тогда
				  Сообщить("Общий счётчик " + Строка(Стр.Счетчик) + " не числится установленным на вводе - показания по нему не вводятся.");
				  Отказ = Истина;
				  Продолжить;
			  КонецЕсли;
		  Иначе
			  Если Состояние.Бокс.Пустая() Тогда
				  Сообщить("Индивидуальный счётчик " + Строка(Стр.Счетчик) + " не привязан к боксу - оформите установку.");
				  Отказ = Истина;
				  Продолжить;
			  КонецЕсли;
		  КонецЕсли;
		  // --- предыдущее показание из регистра на МоментДо ---
		  Стр.ПредыдущееПоказание = Состояние.Показание;	
		  
		  Расчет = ЭлектроУчет.ДельтаПоказаний(Стр.Счетчик, Стр.ПредыдущееПоказание, Стр.Показание);
		  Если Не Расчет.Успех Тогда
			  Сообщить("Счётчик " + Строка(Стр.Счетчик) + ": " + Расчет.Сообщение);
			  Отказ = Истина;
			  Продолжить;
		  КонецЕсли;
		  Если ЗначениеЗаполнено(Стр.Счетчик.ДатаСледующейПоверки)
			  И Стр.Счетчик.ДатаСледующейПоверки < Дата Тогда
			  Сообщить("ВНИМАНИЕ: поверка счетчика " + Строка(Стр.Счетчик)
			  + " просрочена (срок " + Формат(Стр.Счетчик.ДатаСледующейПоверки,"ДЛФ=D") + ").");
		  КонецЕсли;
		  Если Расчет.Дельта > 0 Тогда
			  Движение = Движения.ПотреблениеЭлектроэнергии.Добавить();
			  Движение.Период = Дата;
			  Движение.Счетчик = Стр.Счетчик;
			  Движение.ТипСчетчика = Стр.Счетчик.ТипСчетчика;
			  Движение.КвтЧ = Расчет.Дельта;
			  Движение.Ввод = Состояние.Ввод;
			  Если Не ЭтоОбщий Тогда
				  Движение.Бокс = Состояние.Бокс;
			  КонецЕсли;
		  КонецЕсли;
		  
		  Движение2 = Движения.ТекущиеПоказания.Добавить();
		  Движение2.Период = Дата;
		  Движение2.Счетчик = Стр.Счетчик;
		  Движение2.Показание = Стр.Показание;
	  КонецЦикла;
  КонецПроцедуры
